* Data Sources and Downloading
** County Codes Crosswalk
 =data/county_codes_cw.csv= contains the list of 1940 counties with their state and county codes in NHGIS and ICPSR form.
 It also includes crosswalk wieghts for any possible border changes between 1940 and 1950 generated using the method from [[https://fpeckert.me/eglp/][Eckert et al. (2020)]].
** Historical Census Microdata
:PROPERTIES:
:header-args:R: :session *R:ipums* :tangle R/download-ipums.R :colnames yes :export no
:END:
#+name: load-packages
#+begin_src R :results silent
library(ipumsr)
library(tidyverse)
#+end_src

I download linked full-count census microdata from the IPUMS [[https://usa.ipums.org/usa/mlp/mlp.shtml][Multigenerational Longitudinal Panel]] for the census years 1940 and 1950.
The main IPUMS variables I enclure are each respondant's county of residence at the time of being surveyed, as well as demographics including sex, birthyear, race, and birthplace.
#+name: download-lr-migration-data
#+begin_src R :results silent
ipums_samples <- c("us1940b", "us1950b")
vars = list(
  "STATEFIP", "STATEICP", "COUNTYICP", "ENUMDIST", "CITY", # geographic variables
  "SEX", "BIRTHYR", "RACE", "BPL", "MARST",# demographics
  "CITIZEN",  "EDUC", # assimilation/culture
  "LABFORCE", "OCC1950", "EMPSTAT", # labor market status
  var_spec("NATIVITY",  attached_characteristics = c("mother", "father", "spouse")),
  var_spec("OCCSCORE", attached_characteristics = c("mother", "father", "spouse")),
  var_spec("INCTOT", attached_characteristics = c("mother", "father", "spouse")),
  var_spec("INCWAGE", attached_characteristics = c("mother", "father", "spouse")),
  "INCBUSFM"
)
# download data using IPUMS API
lr_migration_extract <- define_extract_micro(
  collection = "usa",
  description = "linked microdata for internee and control population from 1940 to 1950",
  samples = ipums_samples,
  variables = vars
) |>
  submit_extract() |>
  wait_for_extract() |>
  download_extract("data")
#+end_src

To use the latest versions of the MLP linkages from IPUMS, I download the crosswalk files as csv's from https://usa.ipums.org/usa/mlp/mlp_census_crosswalks.shtml.

Microdata extracted from IPUMS using =ipumsr::download_extract()= function
downloads both the compressed data file (e.g., =usa_00122.dat.gz=)
and the codebook ddi file which is used to label the variables (e.g., =usa_00122.xml=).

For this project, the files needed are located in the =data/= subdirectory:
#+begin_example
├── data/
│   ├── mlp_1940_1950_v1_2_csv
│   │   ├── mlp_1940_1950_v1.2.csv
│   │   └── README_mlp_csv.txt
│   ├── nhgis0032_shape.zip
│   ├── usa_00123.dat.gz
│   ├── usa_00123.xml
│   └── ...
#+end_example

** WRA Camp Internee Records

The internee data file is available in the [[https://catalog.archives.gov/][National Archives]] catalog with the NAID 1264228.

I use the fixed-width text version of this text file from Jaime Arellano-Bover's online replication package at
https://www.openicpsr.org/openicpsr/project/144561/version/V1/view:
=WRA.FORM26.PU.txt=.

* Data Cleaning
** Clean WRA camp records
:PROPERTIES:
:HEADER-ARGS:R: :tangle R/compile_WRA.R :session *R:internment*
:END:
Here is a version of Arellano-Bover's original Stata code to process the WRA form 26 data,
rewritten in R.
The file =WRA.FORM26.PU.txt= is read into R as fixed width data using =read_fwf= from the =readr= package.
*** Variables Names and Labels
#+begin_src R
#------------------------------------------------------------------------------#
#                               README                                         #
# this file was translated from the original stata do file compile_wra.do      #
# from the replication files for "displacement, diversity, and mobility:       #
# careeer impacts of japanese american internment" by jaime arellano-bover     #
# posted here: https://www.jarellanobover.com/research                         #
# translation was helped by the stata to r code translator chatgpt model by    #
# joseph noonan https://chatgpt.com/g/g-ddlktfvbt-stata-to-r-code-translator   #
#------------------------------------------------------------------------------#

library(tidyverse)
library(haven)  # for reading stata data_raw files

# Load dataset
path <- "~/Research/Internment/data/"
#+end_src


The original form included internee's names, the assembly center and WRA camp they were first assigned to,
the county and city of thier previous address before being brought to the assembly centers,
as well as demographic information such as their education attainment, birthplace and year, occupation, and father's characteristics.

#+begin_src R :results silent 
# variables defined by column ranges in original file
column_positions <- fwf_widths(
  c(10,             8,                 1,             1,                 1,
    5,              1,                 1,             1,                 1,
    1,              1,                 2,             1,                 1,
    1,              1,                 6,             1,                 1,
    2,              2,                 1,             1,                 1,
    1,              3,                 3,             3,                 3,
    3,              6,                 5),
  col_names =
  c("last_name",    "first_name",      "initial",     "camp",            "assembly",
    "prev_address", "brth_cntry_pnts", "fath_occ_us", "fath_occ_abroad", "school_jap",
    "school_jap2",  "high_educ",       "arrival_us",  "length_jap",      "times_jap",
    "age_jap",      "military",        "ind_number",  "sex_marrge",      "race",
    "birth_yr",     "birthplace",      "japsch_ssn",  "educ",            "lang",
    "rel",          "qual_occ_1",      "qual_occ_2",  "qual_occ_3",      "pot_occ_1",
    "pot_occ_2",    "file_no",         "file_no_2"))

fw_data <- read_fwf(paste0(path, "WRA.FORM26.PU.txt"), column_positions)
#+end_src

There are some rows which need to be removed due to mistakenly inserted formatting rows and duplicate records.
#+begin_src R :results silent
data_raw <- fw_data |>
  filter(ind_number != "") |> # Drop records with empty ind_number
  # Handle duplicates
  group_by(ind_number, file_no, first_name, last_name) |>
  mutate(dup_n = row_number(), .after = last_name) |>
  ungroup() |>
  filter(dup_n == 1) |>
  select(-dup_n)
#+end_src

Add clean up demographic variables and label according to documentation.
#+begin_src R :results silent
data_labelled <- data_raw |>
  mutate(
    camp = labelled(as.integer(camp),
                    c("Manzanar"       = 1,
                      "Poston"         = 2,
                      "Gila River"     = 3,
                      "Tule Lake"      = 4,
                      "Minidoka"       = 5,
                      "Topaz"          = 6,
                      "Heart Mountain" = 7,
                      "Granada"        = 8,
                      "Rohwer"         = 9,
                      "Jerome"         = 10 )
                    ),
    assembly = case_when(assembly == "-" ~ "10",
                         assembly == "A" ~ "11",
                         assembly == "B" ~ "12",
                         assembly == "C" ~ "13",
                         assembly == "D" ~ "14",
                         assembly == "E" ~ "15",
                         assembly == "F" ~ "16",
                         assembly %in% c("T", "Z") ~ "",
                         .default = assembly),
    assembly = labelled(as.integer(assembly),
                        c("none"        = 0 , 
                          "Manzanar"    = 1 , 
                          "Fresno"      = 2 , 
                          "Marysville"  = 3 , 
                          "Mayor"       = 4 , 
                          "Merced"      = 5 , 
                          "Pinedale"    = 6 , 
                          "Pomona"      = 7 , 
                          "Portland"    = 8 , 
                          "Puyallup"    = 9 , 
                          "Sacramento"  = 10, 
                          "Salinas"     = 11, 
                          "Santa Anita" = 12, 
                          "Stockton"    = 13, 
                          "Tanforan"    = 14, 
                          "Tulare"      = 15, 
                          "Turlock"     = 16 )
                        ),
    sex = case_when(sex_marrge %in% c("1", "2", "3", "4", "5", "0") ~ 0, # men
                    sex_marrge %in% c("6", "7", "8", "9", "-", "&") ~ 1, # women
                    .default = NA),
    sex = labelled(as.integer(sex), c("male" = 0, "female" = 1)),
    marst = case_when(sex_marrge %in% c("1", "6") ~ 1, # single
                      sex_marrge %in% c("2", "9") ~ 2, # married
                      sex_marrge %in% c("3", "8") ~ 3, # widowed
                      sex_marrge %in% c("4", "9") ~ 4, # divorced
                      sex_marrge == "5" ~ 5, # separated
                      .default = NA),
    marst = labelled(as.integer(marst), c("single" = 1,
                                          "married" = 2,
                                          "widowed" = 3,
                                          "divorced" = 4,
                                          "separated" = 5)),
    birth_yr = if_else(as.integer(birth_yr) > 42,
                       as.integer(birth_yr) + 1800, # born after 1842
                       as.integer(birth_yr) + 1900), # born before or during 1942
    race = case_when(race %in% c("4", "7", "L", "O", "V", "5", "J", "M", "P", "W", "6", "K", "N", "Q", "X") ~ 5, # japanese including mixed-race
                     race %in% c("8", "S", "T", "U") ~ 1, # white non-japanese 
                     race %in% c("1", "2", NA) ~ NA), # other race or not specified
    race = labelled(race, c("White" = 1, "Japanese" = 5)),
    bpl_pop = case_when(brth_cntry_pnts %in% c("B", "1", "4", "7", "C") ~ 501, # japan
                        brth_cntry_pnts %in% c("K", "2", "5", "8", "L") ~ 99, # US not specified
                        brth_cntry_pnts %in% c("T", "3", "6", "9", "U") ~ 15, # Hawaii
                        .default = NA), # Hawaii
    bpl_pop = labelled(bpl_pop, c("Japan" = 501, "United States, ns" = 99, "Hawaii" = 15)),
    bpl_mom = case_when(brth_cntry_pnts %in% c("A", "1", "2", "3", "D") ~ 501, # japan
                        brth_cntry_pnts %in% c("J", "4", "5", "6", "M") ~ 99, # US not specified
                        brth_cntry_pnts %in% c("S", "7", "8", "9", "V") ~ 15, # Hawaii
                        .default = NA), # Hawaii
    bpl_mom = labelled(bpl_mom, c("Japan" = 501, "United States, ns" = 99, "Hawaii" = 15)),
    yr_immig = if_else(as.integer(birth_yr) > 42,
                       as.integer(birth_yr) + 1800, # arrived after 1842
                       as.integer(birth_yr) + 1900), # arrived before or during 1942
    nativity = case_when(
      ~ 1, # both parents native-born
      ~ 2, # foreigh father, native mother
      ~ 3, # native father, foriegn mother
      ~ 4, # both parents foreign-born
      ~ 5 # is foreign born themselves
    ),
    educ_bach = ifelse(educ_high %in% c("A", "B", "C", "D", "E", "F", "G", "H", "I", "4"), 1, 0),
  )
#+end_src
*** Previous Address
Group the internees into observable counties.
#+begin_src R
# previous address codes transcribed from WRA form 26 documentation
wra_counties <- read_csv("data/WRA_prev_address_list.csv")
#+end_src
The county names from the WRA records should match the county names from the NHGIS system for counties in 1940.
#+begin_src R :colnames true
nhgis_codes <- read_csv("data/county_codes_cw.csv") |>
  select(STATENAM, NHGISNAM, weight, NHGISST, NHGISCTY, NHGISCTY_1950)

join_counties <- inner_join(nhgis_codes, wra_counties,
                           by = c("STATENAM" = "state", "NHGISNAM" = "county"),
                           relationship = "many-to-many") |>
  select(STATENAM, NHGISNAM, NHGISST, NHGISCTY, prev_address)
#+end_src

#+RESULTS:
| Colorado     | Weld            |  80 | 1230 | 22620 |
| Colorado     | Weld            |  80 | 1230 | 22623 |
| Pennsylvania | York            | 420 | 1330 | 59014 |
| Washington   | Franklin        | 530 |  210 | 11451 |
| Washington   | Whitman         | 530 |  750 | 11401 |
| California   | Alameda         |  60 |   10 | 13810 |
| California   | Alameda         |  60 |   10 | 13811 |
| California   | Alameda         |  60 |   10 | 13812 |
| California   | Alameda         |  60 |   10 | 13813 |
| California   | Alameda         |  60 |   10 | 13814 |
| California   | Contra Costa    |  60 |  130 | 13820 |
| California   | Contra Costa    |  60 |  130 | 13822 |
| California   | Contra Costa    |  60 |  130 | 13823 |
| California   | Contra Costa    |  60 |  130 | 13825 |
| California   | San Francisco   |  60 |  750 | 13841 |
| California   | San Francisco   |  60 |  750 | 13844 |
| California   | San Joaquin     |  60 |  770 | 13560 |
| California   | San Joaquin     |  60 |  770 | 13561 |
| California   | San Joaquin     |  60 |  770 | 13563 |
| California   | San Joaquin     |  60 |  770 | 13564 |
| California   | San Joaquin     |  60 |  770 | 13569 |
| California   | Santa Clara     |  60 |  850 | 13-10 |
| California   | Santa Clara     |  60 |  850 | 13-11 |
| California   | Santa Clara     |  60 |  850 | 13-12 |
| California   | Santa Clara     |  60 |  850 | 13-13 |
| California   | Santa Clara     |  60 |  850 | 13-14 |
| California   | Stanislaus      |  60 |  990 | 13570 |
| California   | Stanislaus      |  60 |  990 | 13571 |
| California   | Stanislaus      |  60 |  990 | 13573 |
| Nevada       | Douglas         | 320 |   50 | 25030 |
| California   | El Dorado       |  60 |  170 | 13240 |
| California   | El Dorado       |  60 |  170 | 13241 |
| California   | Sacramento      |  60 |  670 | 13910 |
| California   | Sacramento      |  60 |  670 | 13911 |
| California   | Sacramento      |  60 |  670 | 13912 |
| California   | Sacramento      |  60 |  670 | 13913 |
| California   | Sacramento      |  60 |  670 | 13914 |
| California   | Sacramento      |  60 |  670 | 13915 |
| California   | Sacramento      |  60 |  670 | 13919 |
| California   | Sacramento      |  60 |  670 | 1391O |
| Washington   | Asotin          | 530 |   30 | 11421 |
| New Mexico   | Curry           | 350 |   90 | 21053 |
| Idaho        | Bannock         | 160 |   50 | 23033 |
| Idaho        | Bingham         | 160 |  110 | 23060 |
| Idaho        | Bingham         | 160 |  110 | 23061 |
| Michigan     | Calhoun         | 260 |  250 | 45134 |
| Missouri     | Henry/Rives     | 290 |  830 | 47422 |
| Washington   | Spokane         | 530 |  630 | 11614 |
| Colorado     | Otero           |  80 |  890 | 22451 |
| Oregon       | Benton          | 410 |   30 | 12112 |
| Oregon       | Lincoln         | 410 |  410 | 12160 |
| Oregon       | Lincoln         | 410 |  410 | 12160 |
| Oregon       | Lane            | 410 |  390 | 12153 |
| Oregon       | Linn            | 410 |  430 | 12170 |
| Oregon       | Polk            | 410 |  530 | 12190 |
| Oregon       | Polk            | 410 |  530 | 12191 |
| Washington   | Benton          | 530 |   50 | 11310 |
| Washington   | Benton          | 530 |   50 | 11314 |
| Washington   | Yakima          | 530 |  770 | 11390 |
| Washington   | Yakima          | 530 |  770 | 11391 |
| Washington   | Yakima          | 530 |  770 | 11394 |
| New York     | Dutchess        | 360 |  270 | 57014 |
| New Mexico   | Santa Fe        | 350 |  490 | 21253 |
| New Mexico   | Santa Fe        | 350 |  490 | 21253 |
| Alabama      | Jefferson       |  10 |  730 | 31374 |
| Idaho        | Bonneville      | 160 |  190 | 23103 |
| Utah         | Box Elder       | 490 |   30 | 27020 |
| New York     | Chemung         | 360 |  150 | 57024 |
| New York     | Chemung         | 360 |  150 | 57025 |
| Texas        | Harris          | 480 | 2010 | 3800& |
| Montana      | Lewis and Clark | 300 |  490 | 24253 |
| Pennsylvania | Philadelphia    | 420 | 1010 | 59025 |
| North Dakota | Burleigh        | 380 |  150 | 49083 |
| California   | Butte           |  60 |   70 | 13310 |
| California   | Butte           |  60 |   70 | 13311 |
| California   | Butte           |  60 |   70 | 13312 |
| California   | Butte           |  60 |   70 | 13313 |
| California   | Butte           |  60 |   70 | 13310 |
| California   | Butte           |  60 |   70 | 13311 |
| California   | Butte           |  60 |   70 | 13312 |
| California   | Butte           |  60 |   70 | 13313 |
| California   | Tehama          |  60 | 1030 | 13350 |
| California   | Tehama          |  60 | 1030 | 13351 |
| California   | Tehama          |  60 | 1030 | 13350 |
| California   | Tehama          |  60 | 1030 | 13351 |
| California   | Colusa          |  60 |  110 | 13320 |
| California   | Plumas          |  60 |  630 | 13200 |
| California   | Sutter          |  60 | 1010 | 13340 |
| California   | Sutter          |  60 | 1010 | 13341 |
| California   | Yuba            |  60 | 1150 | 13370 |
| California   | Yuba            |  60 | 1150 | 13372 |
| Virginia     | Norfolk         | 510 | 1290 | 5-014 |
| Virginia     | Norfolk         | 510 | 1290 | 5-014 |
| Virginia     | Norfolk         | 510 | 1290 | 5-014 |
| Montana      | Park            | 300 |  670 | 24342 |
| Utah         | Carbon          | 490 |   70 | 27040 |
| Washington   | Chelan          | 530 |   70 | 11320 |
| Washington   | Chelan          | 530 |   70 | 11323 |
| Washington   | King            | 530 |  330 | 11510 |
| Washington   | King            | 530 |  330 | 11511 |
| Washington   | King            | 530 |  330 | 11512 |
| Washington   | King            | 530 |  330 | 11514 |
| Washington   | Skagit          | 530 |  570 | 11280 |
| Washington   | Skagit          | 530 |  570 | 11281 |
| Washington   | Skagit          | 530 |  570 | 11282 |
| Washington   | Snohomish       | 530 |  610 | 11200 |
| Washington   | Snohomish       | 530 |  610 | 11204 |
| Nevada       | Lyon            | 320 |  190 | 25100 |
| Oregon       | Clackamas       | 410 |   50 | 12510 |
| Oregon       | Clackamas       | 410 |   50 | 12511 |
| Oregon       | Clackamas       | 410 |   50 | 12512 |
| Oregon       | Clackamas       | 410 |   50 | 12514 |
| Oregon       | Hood River      | 410 |  270 | 12140 |
| Oregon       | Hood River      | 410 |  270 | 12141 |
| Oregon       | Marion          | 410 |  470 | 12180 |
| Oregon       | Marion          | 410 |  470 | 12184 |
| Oregon       | Multnomah       | 410 |  510 | 12520 |
| Oregon       | Multnomah       | 410 |  510 | 12521 |
| Oregon       | Multnomah       | 410 |  510 | 12523 |
| Oregon       | Multnomah       | 410 |  510 | 12524 |
| Oregon       | Wasco           | 410 |  650 | 12360 |
| Oregon       | Wasco           | 410 |  650 | 12362 |
| Oregon       | Washington      | 410 |  670 | 121-0 |
| Oregon       | Washington      | 410 |  670 | 121-1 |
| Oregon       | Yamhill         | 410 |  710 | 121&1 |
| Washington   | Clallam         | 530 |   90 | 11110 |
| Washington   | Clallam         | 530 |   90 | 11112 |
| Washington   | Jefferson       | 530 |  310 | 11130 |
| Washington   | Jefferson       | 530 |  310 | 11131 |
| California   | San Bernardino  |  60 |  710 | 13730 |
| California   | San Bernardino  |  60 |  710 | 13731 |
| California   | San Bernardino  |  60 |  710 | 13732 |
| California   | San Bernardino  |  60 |  710 | 13733 |
| California   | San Bernardino  |  60 |  710 | 13734 |
| Washington   | Clark           | 530 |  110 | 11210 |
| Washington   | Clark           | 530 |  110 | 11213 |
| Oregon       | Columbia        | 410 |   90 | 12130 |
| Washington   | Cowlitz         | 530 |  150 | 11222 |
| Washington   | Cowlitz         | 530 |  150 | 11223 |
| Oregon       | Clatsop         | 410 |   70 | 12120 |
| Oregon       | Clatsop         | 410 |   70 | 12123 |
| Oregon       | Tillamook       | 410 |  570 | 12101 |
| Washington   | Wahkiakum       | 530 |  690 | 11150 |
| Wisconsin    | Grant           | 550 |  430 | 4&221 |
| Montana      | Missoula        | 300 |  630 | 24324 |
| Arizona      | Cochise         |  40 |   30 | 26210 |
| Arizona      | Gila            |  40 |   70 | 26130 |
| Arizona      | Yavapai         |  40 |  250 | 26160 |
| California   | Lake            |  60 |  330 | 13130 |
| California   | Yolo            |  60 | 1130 | 13360 |
| California   | Yolo            |  60 | 1130 | 13362 |
| Illinois     | Cook            | 170 |  310 | 41165 |
| Washington   | Lewis           | 530 |  410 | 11250 |
| Washington   | Lewis           | 530 |  410 | 11251 |
| Washington   | Lewis           | 530 |  410 | 11252 |
| Oregon       | Deschutes       | 410 |  170 | 12430 |
| Oregon       | Jefferson       | 410 |  310 | 12320 |
| Nebraska     | Douglas         | 310 |  550 | 48284 |
| California   | Placer          |  60 |  610 | 13290 |
| California   | Placer          |  60 |  610 | 13291 |
| California   | Placer          |  60 |  610 | 13292 |
| Oregon       | Jackson         | 410 |  290 | 12240 |
| Oregon       | Jackson         | 410 |  290 | 12243 |
| Utah         | Wasatch         | 490 |  510 | 27261 |
| Arkansas     | Pulaski         |  50 | 1190 | 32604 |
| Missouri     | St Louis        | 290 | 1890 | 47953 |
| California   | Fresno          |  60 |  190 | 13510 |
| California   | Fresno          |  60 |  190 | 13511 |
| California   | Fresno          |  60 |  190 | 13512 |
| California   | Fresno          |  60 |  190 | 13513 |
| California   | Fresno          |  60 |  190 | 13514 |
| California   | Kings           |  60 |  310 | 13530 |
| California   | Kings           |  60 |  310 | 13532 |
| California   | Kings           |  60 |  310 | 13533 |
| California   | Madera          |  60 |  390 | 13540 |
| California   | Madera          |  60 |  390 | 13542 |
| California   | Madera          |  60 |  390 | 13544 |
| California   | Merced          |  60 |  470 | 13550 |
| California   | Merced          |  60 |  470 | 13553 |
| California   | Monterey        |  60 |  530 | 13410 |
| California   | Monterey        |  60 |  530 | 13411 |
| California   | Monterey        |  60 |  530 | 13412 |
| California   | Monterey        |  60 |  530 | 13413 |
| California   | Monterey        |  60 |  530 | 13414 |
| California   | Monterey        |  60 |  530 | 13415 |
| California   | San Benito      |  60 |  690 | 13420 |
| California   | San Benito      |  60 |  690 | 13421 |
| California   | Tulare          |  60 | 1070 | 13580 |
| California   | Tulare          |  60 | 1070 | 13581 |
| California   | Tulare          |  60 | 1070 | 13582 |
| California   | Tulare          |  60 | 1070 | 13584 |
| Arizona      | Maricopa        |  40 |  130 | 26240 |
| Arizona      | Maricopa        |  40 |  130 | 26241 |
| Arizona      | Maricopa        |  40 |  130 | 26242 |
| Arizona      | Maricopa        |  40 |  130 | 26244 |
| Arizona      | Pinal           |  40 |  210 | 26254 |
| California   | Mendocino       |  60 |  450 | 13140 |
| California   | Mendocino       |  60 |  450 | 13141 |
| California   | Mendocino       |  60 |  450 | 13143 |
| Washington   | Grays Harbor    | 530 |  270 | 11123 |
| Washington   | Mason           | 530 |  450 | 11261 |
| Washington   | Pacific         | 530 |  490 | 11140 |
| Washington   | Pacific         | 530 |  490 | 11141 |
| Washington   | Thurston        | 530 |  670 | 112-0 |
| Washington   | Thurston        | 530 |  670 | 112-3 |
| Florida      | Pinellas        | 120 | 1030 | 53014 |
| California   | Imperial        |  60 |  250 | 13710 |
| California   | Imperial        |  60 |  250 | 13711 |
| California   | Imperial        |  60 |  250 | 13712 |
| California   | Imperial        |  60 |  250 | 13713 |
| California   | Imperial        |  60 |  250 | 13714 |
| California   | Imperial        |  60 |  250 | 1371B |
| California   | Riverside       |  60 |  650 | 13720 |
| California   | Riverside       |  60 |  650 | 13721 |
| California   | Riverside       |  60 |  650 | 13724 |
| California   | San Diego       |  60 |  730 | 13&10 |
| California   | San Diego       |  60 |  730 | 13&11 |
| California   | San Diego       |  60 |  730 | 13&12 |
| California   | San Diego       |  60 |  730 | 13&13 |
| California   | San Diego       |  60 |  730 | 13&14 |
| Arizona      | Yuma            |  40 |  270 | 26282 |
| California   | Kern            |  60 |  290 | 13520 |
| California   | Kern            |  60 |  290 | 13521 |
| California   | Kern            |  60 |  290 | 13524 |
| Washington   | Island          | 530 |  290 | 11233 |
| California   | Los Angeles     |  60 |  370 | 13010 |
| California   | Los Angeles     |  60 |  370 | 13011 |
| California   | Los Angeles     |  60 |  370 | 13012 |
| California   | Los Angeles     |  60 |  370 | 13013 |
| California   | Los Angeles     |  60 |  370 | 13014 |
| California   | Los Angeles     |  60 |  370 | 13015 |
| California   | Los Angeles     |  60 |  370 | 13017 |
| California   | Los Angeles     |  60 |  370 | 1301F |
| California   | San Luis Obispo |  60 |  790 | 13430 |
| California   | San Luis Obispo |  60 |  790 | 13431 |
| California   | San Luis Obispo |  60 |  790 | 13432 |
| California   | Santa Barbara   |  60 |  830 | 13610 |
| California   | Santa Barbara   |  60 |  830 | 13611 |
| California   | Santa Barbara   |  60 |  830 | 13612 |
| California   | Santa Barbara   |  60 |  830 | 13614 |
| California   | Ventura         |  60 | 1110 | 13620 |
| California   | Ventura         |  60 | 1110 | 13621 |
| California   | Ventura         |  60 | 1110 | 13622 |
| California   | Ventura         |  60 | 1110 | 13623 |
| Washington   | Pierce          | 530 |  530 | 11520 |
| Washington   | Pierce          | 530 |  530 | 11521 |
| Washington   | Pierce          | 530 |  530 | 11522 |
| Washington   | Pierce          | 530 |  530 | 11524 |
| Washington   | Kitsap          | 530 |  350 | 11240 |
| Washington   | Kitsap          | 530 |  350 | 11243 |
| California   | Modoc           |  60 |  490 | 13270 |
| California   | Modoc           |  60 |  490 | 13272 |
| Pennsylvania | Lackawanna      | 420 |  690 | 5900& |
| California   | Napa            |  60 |  550 | 13150 |
| California   | Napa            |  60 |  550 | 13152 |
| California   | Sonoma          |  60 |  970 | 13160 |
| California   | Sonoma          |  60 |  970 | 13161 |
| California   | Sonoma          |  60 |  970 | 13162 |
| California   | Sonoma          |  60 |  970 | 13163 |
| California   | Shasta          |  60 |  890 | 132&0 |
| California   | Orange          |  60 |  590 | 13020 |
| California   | Orange          |  60 |  590 | 13021 |
| California   | Orange          |  60 |  590 | 13022 |
| California   | Orange          |  60 |  590 | 13023 |
| California   | Orange          |  60 |  590 | 13024 |
| California   | Marin           |  60 |  410 | 13830 |
| California   | Marin           |  60 |  410 | 13831 |
| California   | Marin           |  60 |  410 | 13832 |
| California   | Santa Cruz      |  60 |  870 | 13440 |
| California   | Santa Cruz      |  60 |  870 | 13442 |
| California   | Santa Cruz      |  60 |  870 | 13443 |
| Virginia     | Suffolk City    | 510 | 8000 | 5-023 |
| California   | Solano          |  60 |  950 | 13860 |
| California   | Solano          |  60 |  950 | 13863 |
| California   | Nevada          |  60 |  570 | 13280 |
| California   | Nevada          |  60 |  570 | 13282 |
| Washington   | Whatcom         | 530 |  730 | 112&0 |
| Washington   | Whatcom         | 530 |  730 | 112&3 |
| Washington   | Whatcom         | 530 |  730 | 112&4 |
| California   | San Mateo       |  60 |  810 | 13850 |
| California   | San Mateo       |  60 |  810 | 13851 |
| California   | San Mateo       |  60 |  810 | 13852 |
| California   | San Mateo       |  60 |  810 | 13853 |
| California   | San Mateo       |  60 |  810 | 13855 |
| Washington   | San Juan        | 530 |  550 | 11270 |

#+begin_src R
data_int <- data_labelled |>
  left_join(join_counties, by = "prev_address")
#+end_src

#+RESULTS:

Checking the results by county:
#+begin_src R
intrn_grps <- data_int |>
  filter(!is.na(STATENAM), !is.na(NHGISNAM)) |>
  count(STATENAM, NHGISNAM, NHGISST, NHGISCTY, sex, birth_yr)

write_csv(intrn_grps, file = "data/internment_groups.csv")

intrn_grps |>
  arrange(desc(n)) |>
  head(n=25) |> 
  knitr::kable(format = "org")
#+end_src

#+RESULTS:
|   | STATENAM                                                        | NHGISNAM    | NHGISST | NHGISCTY | sex | birth_yr |   n |
|   | :----------+:-----------+:-------+:--------+---:+--------:+---: |             |         |          |     |          |     |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1921 | 565 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1921 | 538 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1922 | 528 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1923 | 518 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1920 | 493 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1923 | 478 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1919 | 475 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1925 | 466 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1925 | 460 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1920 | 456 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1922 | 456 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1924 | 454 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1924 | 428 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1918 | 407 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1926 | 402 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1917 | 381 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1926 | 380 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1927 | 373 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1888 | 372 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1916 | 368 |
|   | California                                                      | Los Angeles |      60 |      370 |   1 |     1915 | 362 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1918 | 354 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1919 | 347 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1915 | 338 |
|   | California                                                      | Los Angeles |      60 |      370 |   0 |     1941 | 337 |

** 1940 County-Level Japanese Population
:PROPERTIES:
:HEADER-ARGS:R: :session *R:internment* :results silent
:END:
#+begin_src R
library(ipumsr)
# data extract file
JApop1940_extract <- "data/fullcount_census/usa_00064.xml"
microdt_1940 <- read_ipums_micro(JApop1940_extract)
#+end_src

#+RESULTS:

Collect all Japanese-American micro-records by county.

#+begin_src R
JAcounty_pop <- microdt_1940 |>
  group_by(STATEFIP, COUNTYICP) |>
  summarize(pop = n())

internment_prob <- intrn_grps |>
  group_by(STATENAM, NHGISNAM, NHGISST, NHGISCTY) |> 
  summarise(internees = sum(n)) |> 
  mutate(STATEFIP = as.integer(NHGISST) / 10,
         COUNTYICP = as.integer(NHGISCTY)) |>
  full_join(JAcounty_pop, by = c("STATEFIP", "COUNTYICP")) |>
  mutate(p_intern = internees / pop)
#+end_src

** MLP Crosswalk Links
:PROPERTIES:
:HEADER-ARGS:R: :session *R:internment* :tangle R/clean_fc-census.R :results silent
:END:

The original micro data files from IPUMS are too large to fit in memory,
and the MLP v1.2 linkages are provided as crosswalks which have to be joined to the data.
I first read both crosswalks and extract microdata into a local database file
so that I can use SQL operations via the =duckdb= API in R.

#+name: define-objects
#+begin_src R
# open database connection with duckdb
library(ipumsr)
library(data.table)
library(dplyr)
library(dtplyr)
library(dbplyr)
library(duckdb)
database <- dbConnect(duckdb(), dbdir = "data/ipums_db.duckdb")
# data extract file
extract <- "data/fullcount_census/usa_00123.xml"
ddi <- read_ipums_ddi(extract)
# table name in database
tbl <- "ipums_microdata"
# crosswalk files for each adjacent census year pair
cw45_csv <- "data/mlp_1940_1950_v1_2_csv/mlp_1940_1950_v1.2.csv"
#+end_src

*** Database Reading
To manage how much memory is used at once, I read the ddi file in chunks to the database as its own table.
I also read the crosswalks in as separate tables in the database.

#+name: write-database
#+begin_src R :eval false
# read in ipums extract to database in chunks
read_ipums_micro_chunked(
  ddi, # path to ddi .xml file in same location as data download
  callback = readr::SideEffectChunkCallback$new(
    function(x, pos) {
      if (pos == 1) {
        dbWriteTable(database, tbl, x, overwrite = TRUE)
      } else {
        dbWriteTable(database, tbl, x, overwrite = FALSE, append = TRUE)
      }
    }
  ),
  chunk_size = 1e7 # observations to read per chunk
)
#+end_src

#+begin_src R :eval false
# read crosswalk csv files into database
duckdb_read_csv(database, "mlp_crosswalks", cw45_csv)
#+end_src
** MLP Linked Microrecords Sample
At this stage, I only need the state and county of each person who is linked across census years.
For each decade-to-decade comparison (1920 to 1930, and 1930 to 1940),
I join the state and county location by =HISTID= code for the appropriate year in the crosswalk file.
Then I count how many linked individuals appear in each county-county migration group
and drop individuals who do not report a county location in either decade. 

***** TODO Rewrite this function to group by demographic categories
#+begin_src R
link_internee <- function(
  db_file = database, # your DuckDB connection
  dt_table,             # microdata table in DB
  cw_table,             # name of crosswalk table in DB, e.g. "cw_1920_1930"
  yr1, yr2,             # start and end year of each decade
  histid1, histid2,     # e.g. "histid_1920", "histid_1930"
  out_csv = NULL        # optional path to write csv
) {
  # open the database connection
  db <- dbConnect(duckdb(), dbdir = db_file)
  # bring needed microdata into a tibble for joining
  d1 <- tbl(db, dt_table) |>
    filter(YEAR == yr1, RACE == 5) |> # decade start year
    select(
      HISTID, STATEFIP, COUNTYICP, ENUMDIST, CITY, SEX, MARST, BIRTHYR, RACE, SEX, LABFORCE, INCWAGE, OCC1950, EDUC, CITIZEN, NATIVITY, NATIVITY_MOM, NATIVITY_POP
    )
  d2 <- tbl(db, dt_table) |>
    filter(YEAR == yr2, RACE == 5) |> # decade end year
    select(
      # make variable selection for linked dataset
      HISTID, STATEFIP, COUNTYICP, CITY, SEX, MARST, BIRTHYR, RACE, SEX, LABFORCE, INCWAGE, INCTOT, OCC1950, EDUC, CITIZEN, NATIVITY, NATIVITY_MOM, NATIVITY_POP
    )
  # histid to be used in appropriate cw file
  cw <- tbl(db, cw_table) |>
    rename(hid1 = paste("histid", yr1, sep = "_"), hid2 = paste("histid", yr2, sep = "_"))
  # join histids to selected data from year 1
  l1 <- d1 |>
    rename(hid1 = HISTID) |>
    inner_join(cw, by = "hid1")
  # join histids to selected data from year 2
  l2 <- d2 |>  
    rename(hid2 = HISTID) |>
    inner_join(cw, by = "hid2")
  # join all selected data between years by crosswalked histids
  results <- full_join(l1, l2, by = c("hid1", "hid2"), suffix = c("_1940", "_1950")) |>
    # get rid of leftover linking varibles
    select(!c("hid1", "hid2")) |>
    collect()
  
  if (!is.null(out_csv)) {
    write.csv(results, out_csv, row.names = FALSE)
  }
  
  return(results)
}
#+end_src

***** Apply decade-level summary function to all years
#+name: link-locations
#+begin_src R :exports results
# 1940 -> 1950
internee_data <- link_internee(
  db_file  = "data/ipums_db.duckdb",
  dt_table = "ipums_microdata",
  cw_table = "mlp_crosswalks",
  yr1      = 1940,
  yr2      = 1950,
  histid1  = "histid_1940",
  histid2  = "histid_1950",
  out_csv  = NULL
)

readr::write_csv(internee_data, file = "data/linked_internee_sample.csv")
#+end_src

This procedure leaves me with a dataset of all MLP records of anyone reported as Japanese-American with links between the 1940 and 1950 census.
This is about 5,000 linked Japanese-American individuals with observable county locations in 1940 and 1950.


